import akshare as ak

# 接口: stock_market_fund_flow
# 目标地址: https://data.eastmoney.com/zjlx/dpzjlx.html
# 描述: 东方财富网-数据中心-资金流向-大盘
# 限量: 单次获取大盘资金流向历史数据
# 更新频率: 每日收盘后更新
# example:
#             日期   上证-收盘价  上证-涨跌幅    深证-收盘价  深证-涨跌幅      主力净流入-净额  主力净流入-净占比     超大单净流入-净额  超大单净流入-净占比      大单净流入-净占比      中单净流入-净额  中单净流入-净占比      小单净流入-净额  小单净流入-净占比
# 0    2025-04-15  3267.66    0.15   9858.10   -0.27 -2.530229e+10      -2.35 -1.141320e+10       -1.06 -1.388909e+10      -1.29  7.168492e+08       0.07  2.458545e+10       2..28    

# stock_market_fund_flow_df = ak.stock_market_fund_flow()
# print(stock_market_fund_flow_df)

# -----------------------------------------------------------------------------------------------------

# 个股资金流
# 接口: stock_fund_flow_individual
# 目标地址: https://data.10jqka.com.cn/funds/ggzjl/#refCountId=data_55f13c2c_254
# 描述: 同花顺-数据中心-资金流向-个股资金流
# 限量: 单次获取指定 symbol 的概念资金流数据
# 更新频率: 每日收盘后更新,同时也需要即时更新
# example:
#             序号    股票代码  股票简称     最新价      涨跌幅     换手率   流入资金   流出资金         净额     成交额
# 0        1  301099  雅创电子   49.34   19.99%  13.23%  2.76亿  2.85亿   -961.51万   5.61亿

stock_fund_flow_individual_df = ak.stock_fund_flow_individual(symbol="即时")
print(stock_fund_flow_individual_df)

# -----------------------------------------------------------------------------------------------------
# 接口: stock_xjll_em

# 目标地址: http://data.eastmoney.com/bbsj/202003/xjll.html

# 描述: 东方财富-数据中心-年报季报-业绩快报-现金流量表

# 限量: 单次获取指定 date 的现金流量表数据

# 输入参数
# date: choice of {"20200331", "20200630", "20200930", "20201231", "..."}; 从 20100331 开始

# example:
#             序号    股票代码   股票简称     净现金流-净现金流   净现金流-同比增长  经营性现金流-现金流量净额  经营性现金流-净现金流占比  投资性现金流-现金流量净额  投资性现金流-净现金流占比  融资性现金流-现金流量净额  融资性现金流-净现金流占比        公告日期
# 0        1  601026   道生天合 -2.343372e+08 -196.593490  -2.461727e+08    -105.050639  -1.019870e+07      -4.352148   2.205098e+07     2.883807e+07      12.206254  2025-10-13

# stock_xjll_em_df = ak.stock_xjll_em(date="20250630")
# print(stock_xjll_em_df)

# -----------------------------------------------------------------------------------------------------
# 接口: stock_zcfz_em
# 目标地址: https://data.eastmoney.com/bbsj/202003/zcfz.html
# 描述: 东方财富-数据中心-年报季报-业绩快报-资产负债表
# 限量: 单次获取指定 date 的资产负债表数据
# 输入参数:
#     date: choice of {"20200331", "20200630", "20200930", "20201231", "..."}; 从 20100331 开始
# example:
#             序号    股票代码   股票简称       资产-货币资金       资产-应收账款         资产-存货        资产-总资产   资产-总资产同比       负债-应付账款     负债-预收账款        负债-总负债                                                           
#负债-总负债同比       资产负债率        股东权益合计        公告日期
# 0        1  601026   道生天合  6.088989e+08  1.305857e+09  3.127690e+08  3.832308e+09  21.640034  4.044546e+08         NaN  1.914938e+09  33.908043   49.968265  1.917370e+09  2025-10-13      
# stock_zcfz_em_df = ak.stock_zcfz_em(date="20250630")
# print(stock_zcfz_em_df)


# -----------------------------------------------------------------------------------------------------

# 接口: stock_share_change_cninfo
# 目标地址: https://webapi.cninfo.com.cn/#/apiDoc
# 描述: 巨潮资讯-数据-公司股本变动
# 限量: 单次获取指定 symbol 在 start_date 和 end_date 之间的公司股本变动数据
# 输入参数
# symbol: 股票代码
# start_date: 开始日期
# end_date: 结束日期
# example:
#             序号    股票代码   股票简称     净现金流-净现金流   净现金流-同比增长  经营性现金流-现金流量净额  经营性现金流-净现金流占比  投资性现金流-现金流量净额  投资性现金流-净现金流占比  融资性现金流-现金流量净额  融资性现金流-净现金流占比        公告日期
# 0        1  601026   道生天合 -2.343372e+08 -196.593490  -2.461727e+08    -105.050639  -1.019870e+07      -4.352148   2.205098e+07     2.883807e+07      12.206254  2025-10-13

# stock_share_change_cninfo_df = ak.stock_share_change_cninfo(symbol="002594", start_date="20201227", end_date="20251014")
# print(stock_share_change_cninfo_df)

# -----------------------------------------------------------------------------------------------------

# 接口: stock_yjbb_em
# 目标地址: http://data.eastmoney.com/bbsj/202003/yjbb.html
# 描述: 东方财富-数据中心-年报季报-业绩报表
# 限量: 单次获取指定 date 的业绩报告数据
# 输入参数
# date: choice of {"20200331", "20200630", "20200930", "20201231", "..."}; 从 20100331 开始
# example:
#             序号    股票代码   股票简称   每股收益   营业总收入-营业总收入  营业总收入-同比增长  营业总收入-季度环比增长      净利润-净利润    净利润-同比增长  净利润-季度环比增长      每股净资产                                                                      
# 净资产收益率  每股经营现金流量      销售毛利率    所处行业      最新公告日期
# 0        1  603887   城地香江  0.070  5.580482e+08   -1.671591      -52.2553  32634689.88  -56.930000    104.8519   6.928400    0.95  0.052702  22.975451   互联网服务  2025-06-30

# stock_yjbb_em_df = ak.stock_yjbb_em(date="20220331")
# print(stock_yjbb_em_df)

# -----------------------------------------------------------------------------------------------------
# 接口: stock_news_em
# 目标地址: https://so.eastmoney.com/news/s?keyword=603777
# 描述: 东方财富指定个股的新闻资讯数据
# 限量: 指定 symbol 当日最近 100 条新闻资讯数据
# 输入参数
# symbol: 股票代码
# example:
#             关键词                                       新闻标题                                               新闻内容                 发布时间          文章来源
#               新闻链接
# 0   603777                         来伊份控股股东爱屋企管减持668万股  来伊份（603777）控股股东爱屋企管于2025年9月24日至2025年9月30日通过集中竞...  2025-09-30 18:42:11           财中社  http://finance.eastmoney.com/a/202509303527579...
# stock_news_em_df = ak.stock_news_em(symbol="603777")
# print(stock_news_em_df)

# -----------------------------------------------------------------------------------------------------
# 接口: stock_hsgt_hold_stock_em
# 目标地址: https://data.eastmoney.com/hsgtcg/list.html
# 描述: 东方财富网-数据中心-沪深港通持股-个股排行
# 限量: 单次获取指定 market 和 indicator 的所有数据
# 输入参数: market	str	market="沪股通"; choice of {"北向", "沪股通", "深股通"}
# indicator	str	indicator="沪股通"; choice of {"今日排行", "3日排行", "5日排行", "10日排行", "月排行", "季排行", "年排行"}
# example:
#   序号      代码    名称   今日收盘价  今日涨跌幅    今日持股-股数     今日持股-市值  今日持股-占流通股比  今日持股-占总股本比  今日增持估计-股数  今日增持估计-市值  今日增持估计-市值增
# 幅  今日增持估计-占流通股比  今日增持估计-占总股本比  所属板块          日期
# 0        1  600050  中国联通    4.73   4.42  115290.52   545324.17        3.72        3.63    9170.78   42969.67         8.64          3.06          2.98  通信服务  2024-08-16
# stock_em_hsgt_hold_stock_df = ak.stock_hsgt_hold_stock_em(market="沪股通", indicator="今日排行")
# print(stock_em_hsgt_hold_stock_df)

# -----------------------------------------------------------------------------------------------------
# 接口: stock_gsrl_gsdt_em
# 目标地址: https://data.eastmoney.com/gsrl/gsdt.html
# 描述: 东方财富网-数据中心-股市日历-公司动态
# 限量: 单次返回指定交易日的数据
#输入参数
# date: 交易日
# example:
# 序号      代码    简称  事件类型                                               具体事项         交易日
# 0    1  000669  ST金鸿  资产重组  公司于近日收到新能国际告知函,获悉北京市第一中级人民法院将于2023年8月3日10时至202...  2023-08-08
# stock_gsrl_gsdt_em_df = ak.stock_gsrl_gsdt_em(date="20251014")
# print(stock_gsrl_gsdt_em_df)

# -----------------------------------------------------------------------------------------------------
# -----------------------------------------------------------------------------------------------------
# 接口: stock_sse_summary
# 目标地址: http://www.sse.com.cn/market/stockdata/statistic/
# 描述: 上海证券交易所-股票数据总貌
# 限量: 单次返回最近交易日的股票数据总貌(当前交易日的数据需要交易所收盘后统计)

# stock_sse_summary_df = ak.stock_sse_summary()
# print(stock_sse_summary_df)

# -----------------------------------------------------------------------------------------------------
# 接口: stock_sse_deal_daily
# 目标地址: http://www.sse.com.cn/market/stockdata/overview/day/
# 描述: 上海证券交易所-数据-股票数据-成交概况-股票成交概况-每日股票情况
# 限量: 单次返回指定日期的每日概况数据, 当前交易日数据需要在收盘后获取; 注意仅支持获取在 20211227（包含）之后的数据
# 输入参数
# date: 交易日
# example:
# 单日情况           股票          主板A       主板B         科创板  股票回购
# 0    挂牌数    2321.0000    1693.0000   43.0000    585.0000   0.0
# stock_sse_deal_daily_df = ak.stock_sse_deal_daily(date="20250221")
# print(stock_sse_deal_daily_df)

# -----------------------------------------------------------------------------------------------------
# 接口: stock_individual_info_em
# 目标地址: http://quote.eastmoney.com/concept/sh603777.html?from=classic
# 描述: 东方财富-个股-股票信息
# 限量: 单次返回指定 symbol 的个股信息
# 输入参数
# symbol: 股票代码
# example:
# item                value
# 0    最新                11.57
# 1  股票代码               000001
# 2  股票简称                 平安银行
# 3   总股本        19405918198.0
# 4   流通股        19405600653.0
# 5   总市值  224526473550.860016
# 6  流通市值  224522799555.209991
# 7    行业                   银行
# 8  上市时间             19910403
# stock_individual_info_em_df = ak.stock_individual_info_em(symbol="000001")
# print(stock_individual_info_em_df)

# -----------------------------------------------------------------------------------------------------
# 接口: stock_bid_ask_em
# 目标地址: https://quote.eastmoney.com/sz000001.html
# 描述: 东方财富-行情报价
# 限量: 单次返回指定股票的行情报价数据
# 输入参数
# symbol: 股票代码
# example:
#   item         value
# 0       sell_5  1.162000e+01
# 1   sell_5_vol  8.067000e+05
# 2       sell_4  1.161000e+01
# 3   sell_4_vol  7.040000e+05
# 4       sell_3  1.160000e+01
# 5   sell_3_vol  2.177600e+06
# 6       sell_2  1.159000e+01
# 7   sell_2_vol  1.814700e+06
# 8       sell_1  1.158000e+01
# 9   sell_1_vol  8.628000e+05
# 10       buy_1  1.157000e+01
# 11   buy_1_vol  1.851000e+05
# 12       buy_2  1.156000e+01
# 13   buy_2_vol  4.912000e+05
# 14       buy_3  1.155000e+01
# 15   buy_3_vol  9.584000e+05
# 16       buy_4  1.154000e+01
# 17   buy_4_vol  3.862000e+05
# 18       buy_5  1.153000e+01
# 19   buy_5_vol  3.792000e+05
# 20          最新  1.157000e+01
# 21          均价  1.152000e+01
# 22          涨幅  1.490000e+00
# 23          涨跌  1.700000e-01
# 24          总手  1.843428e+06
# 25          金额  2.124120e+09
# 26          换手  9.500000e-01
# 27          量比  1.730000e+00
# 28          最高  1.160000e+01
# 29          最低  1.136000e+01
# 30          今开  1.139000e+01
# 31          昨收  1.140000e+01
# 32          涨停  1.254000e+01
# 33          跌停  1.026000e+01
# 34          外盘  1.139048e+06
# 35          内盘  7.043800e+05
# stock_bid_ask_em_df = ak.stock_bid_ask_em(symbol="000001")
# print(stock_bid_ask_em_df)

# -----------------------------------------------------------------------------------------------------
# 接口: stock_zh_a_spot_em
# 目标地址: https://quote.eastmoney.com/center/gridlist.html#hs_a_board
# 描述: 东方财富网-沪深京 A 股-实时行情数据
# 限量: 单次返回所有沪深京 A 股上市公司的实时行情数据
# example:
# 序号      代码     名称    最新价    涨跌幅   涨跌额        成交量           成交额     振幅     最高     最低     今开     昨收    量比    换手率  市盈率-动态   市净率           总市
# 值          流通市值   涨速  5分钟涨跌  60日涨跌幅  年初至今涨跌幅
# 0        1  600617   国新能源   3.36  10.16  0.31  1063381.0  3.468707e+08   9.84   3.36   3.06   3.08   3.05  3.83   5.99   43.31  1.87  6.482084e+09  5.965823e+09  0.0    0.0   16.26    24.44
# stock_zh_a_spot_em_df = ak.stock_zh_a_spot_em()
# print(stock_zh_a_spot_em_df)


# -----------------------------------------------------------------------------------------------------
# 接口: stock_sh_a_spot_em
# 目标地址: http://quote.eastmoney.com/center/gridlist.html#sh_a_board
# 描述: 东方财富网-沪 A 股-实时行情数据
# 限量: 单次返回所有沪 A 股上市公司的实时行情数据
# 返回类型
# 名称	类型	描述
# 序号	int64	-
# 代码	object	-
# 名称	object	-
# 最新价	float64	-
# 涨跌幅	float64	注意单位: %
# 涨跌额	float64	-
# 成交量	float64	注意单位: 手
# 成交额	float64	注意单位: 元
# 振幅	float64	注意单位: %
# 最高	float64	-
# 最低	float64	-
# 今开	float64	-
# 昨收	float64	-
# 量比	float64	-
# 换手率	float64	注意单位: %
# 市盈率-动态	float64	-
# 市净率	float64	-
# 总市值	float64	注意单位: 元
# 流通市值	float64	注意单位: 元
# 涨速	float64	-
# 5分钟涨跌	float64	注意单位: %
# 60日涨跌幅	float64	注意单位: %
# 年初至今涨跌幅	float64	注意单位: %
# 接口示例
# example:
# 序号      代码     名称    最新价    涨跌幅   涨跌额        成交量           成交额     振幅     最高     最低     今开     昨收    量比    换手率  市盈率-动态   市净率           总市
# 值          流通市值   涨速  5分钟涨跌  60日涨跌幅  年初至今涨跌幅
# 0        1  600617   国新能源   3.36  10.16  0.31  1063381.0  3.468707e+08   9.84   3.36   3.06   3.08   3.05  3.83   5.99   43.31  1.87  6.482084e+09  5.965823e+09  0.0    0.0   16.26    24.44
# stock_sh_a_spot_em_df = ak.stock_sh_a_spot_em()
# print(stock_sh_a_spot_em_df)



# -----------------------------------------------------------------------------------------------------
# 接口: stock_kc_a_spot_em
# 目标地址: http://quote.eastmoney.com/center/gridlist.html#kcb_board
# 描述: 东方财富网-科创板-实时行情
# 限量: 单次返回所有科创板的实时行情数据
# 返回类型
# 名称	类型	描述
# 序号	int64	-
# 代码	object	-
# 名称	object	-
# 最新价	float64	-
# 涨跌幅	float64	注意单位: %
# 涨跌额	float64	-
# 成交量	float64	注意单位: 手
# 成交额	float64	注意单位: 元
# 振幅	float64	注意单位: %
# 最高	float64	-
# 最低	float64	-
# 今开	float64	-
# 昨收	float64	-
# 量比	float64	-
# 换手率	float64	注意单位: %
# 市盈率-动态	float64	-
# 市净率	float64	-
# 总市值	float64	注意单位: 元
# 流通市值	float64	注意单位: 元
# 涨速	float64	-
# 5分钟涨跌	float64	注意单位: %
# 60日涨跌幅	float64	注意单位: %
# 年初至今涨跌幅	float64	注意单位: %

# stock_kc_a_spot_em_df = ak.stock_kc_a_spot_em()
# print(stock_kc_a_spot_em_df)

# -----------------------------------------------------------------------------------------------------

# 接口: stock_zh_a_hist

# 目标地址: https://quote.eastmoney.com/concept/sh603777.html?from=classic(示例)

# 描述: 东方财富-沪深京 A 股日频率数据; 历史数据按日频率更新, 当日收盘价请在收盘后获取

# 限量: 单次返回指定沪深京 A 股上市公司、指定周期和指定日期间的历史行情日频率数据

# 输入参数

# 名称	类型	描述
# symbol	str	symbol='603777'; 股票代码可以在 ak.stock_zh_a_spot_em() 中获取
# period	str	period='daily'; choice of {'daily', 'weekly', 'monthly'}
# start_date	str	start_date='20210301'; 开始查询的日期
# end_date	str	end_date='20210616'; 结束查询的日期
# adjust	str	默认返回不复权的数据; qfq: 返回前复权后的数据; hfq: 返回后复权后的数据
# timeout	float	timeout=None; 默认不设置超时参数


# 名称	类型	描述
# 日期	object	交易日
# 股票代码	object	不带市场标识的股票代码
# 开盘	float64	开盘价
# 收盘	float64	收盘价
# 最高	float64	最高价
# 最低	float64	最低价
# 成交量	int64	注意单位: 手
# 成交额	float64	注意单位: 元
# 振幅	float64	注意单位: %
# 涨跌幅	float64	注意单位: %
# 涨跌额	float64	注意单位: 元
# 换手率	float64	注意单位: %

# stock_zh_a_hist_df = ak.stock_zh_a_hist(symbol="000001", period="daily", start_date="20170301", end_date='20240528', adjust="")
# print(stock_zh_a_hist_df)
# -----------------------------------------------------------------------------------------------------